In [1]:
# Подключение библиотек
import numpy as np
import pandas as pd

## Слияние данных

Создадим DataFrame, где хранятся id авторов и их фамилии

In [2]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Pushkin', 'Tolstoy', 'Dostoevsky']},
                       columns = ['author_id', 'author_name'])

In [3]:
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

Создадим DataFrame, где хранятся id автора и название книги

In [4]:
books = pd.DataFrame({'author_id': [2, 3, 3, 4],
                      'book_title': ['War and Peace', 'The Idiot', 'Crime and Punishment', 'Fathers and Sons']})

In [5]:
books

   author_id            book_title
0          2         War and Peace
1          3             The Idiot
2          3  Crime and Punishment
3          4      Fathers and Sons

Если мы хотим посмотреть название книги и фамили автора, то надо применить функцию
### Merge

In [6]:
df1 = pd.merge(authors, books, on = 'author_id', how = 'inner')
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment

Где on = 'По какому столбцу соединяем данные'

### Left Merge

In [7]:
df2 = pd.merge(authors, books, on = 'author_id', how = 'left')
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

### Right Merge

In [8]:
df3 = pd.merge(authors, books, on = 'author_id', how = 'right')
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment
3          4         NaN      Fathers and Sons

### Outer Merge

In [9]:
df4 = pd.merge(authors, books, on = 'author_id', how = 'outer')
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

## Работа с пропущенными данными

Просмотрим данные, где название книги пропущенно (isnull)

In [10]:
df4.loc[df4['book_title'].isnull(), :]

   author_id author_name book_title
0          1     Pushkin        NaN

Просмотрим данные, где название книги не пропущенно (notnull)

In [11]:
df4.loc[df4['book_title'].notnull(), :]

   author_id author_name            book_title
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

Пропущенные значения названий книг, заполним значениями 'unknown'

In [12]:
df4['book_title'] = df4['book_title'].fillna('unknown')
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

Пропущенные значения фамилий авторов, заполним значениями 'unknown'

In [13]:
df4['author_name'].fillna('unknown', inplace=True)
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4     unknown      Fathers and Sons

## Добавление столбцов в DataFrame

In [14]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       NaN
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       NaN

Заменим пропущенные значения 0.0

In [15]:
df4['quantity'].fillna(0, inplace = True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       0.0

Заменим тип данных в столбце quantity на int

In [16]:
df4['quantity'] = df4['quantity'].astype(int)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

Так как индекс не используется, можно заменить его на другой столбец, а именно на author_name

In [17]:
df4.set_index('author_id', inplace = True)
df4

          author_name            book_title  quantity
author_id
1             Pushkin               unknown         0
2             Tolstoy         War and Peace         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  Crime and Punishment         1
4             unknown      Fathers and Sons         0

Обратная операция

In [18]:
df4.reset_index(inplace = True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

## Удаление данных
Добавим новый столбец:

In [19]:
df4['price'] = 500
df4

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    500
1          2     Tolstoy         War and Peace         1    500
2          3  Dostoevsky             The Idiot         1    500
3          3  Dostoevsky  Crime and Punishment         1    500
4          4     unknown      Fathers and Sons         0    500

Удалим столбец:

In [20]:
df4 = df4.drop('price', axis = 1)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

Удалим строку (по значению индекса)

In [21]:
df4 = df4.drop(1, axis = 0)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

## Сортировка

Вернёмм удалённую строку:

In [22]:
df4 = df4.append(pd.DataFrame({'author_id': [2],
                                     'author_name': ['Tolstoy'],
                                     'book_title': ['War and Peace'],
                                     'quantity': [1]},
                                     columns=['author_id', 'author_name', 'book_title', 'quantity']),
                                  ignore_index=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          3  Dostoevsky             The Idiot         1
2          3  Dostoevsky  Crime and Punishment         1
3          4     unknown      Fathers and Sons         0
4          2     Tolstoy         War and Peace         1

Отсортируем по столбцу author_id:

In [23]:
df4 = df4.sort_values(by='author_id')
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
4          2     Tolstoy         War and Peace         1
1          3  Dostoevsky             The Idiot         1
2          3  Dostoevsky  Crime and Punishment         1
3          4     unknown      Fathers and Sons         0

После сортировки индексы неупорядочены.

Преустановим индексы:

In [24]:
df4 = df4.reset_index(drop=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

## Соединение DataFrame

Конкатенация по оси 0 (добавление новых строк)

In [27]:
# Сначала создадим новый DataFrame
df5 = pd.DataFrame({'author_id': [3, 5], 'author_name': ['Dostoevsky', 'Chekhov'],
                    'book_title':['The Gambler', 'Three Sisters'], 'quantity': [2, 3]},
                   columns=['author_id', 'author_name', 'book_title', 'quantity'])
df5

   author_id author_name     book_title  quantity
0          3  Dostoevsky    The Gambler         2
1          5     Chekhov  Three Sisters         3

Соединение строк DataFrame

In [30]:
df6 = pd.concat([df4, df5], axis = 0, ignore_index=True)
df6

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0
5          3  Dostoevsky           The Gambler         2
6          5     Chekhov         Three Sisters         3

In [32]:
# Создадим ещё один DataFrame для конкатенации по оси 1 (добавление новых столбцов)
prices = pd.DataFrame({'price': [700, 450, 500, 400, 350]}, columns=['price'], index=[1, 2, 3, 5, 6])
prices

   price
1    700
2    450
3    500
5    400
6    350

In [33]:
df7 = pd.concat([df6, prices], axis = 1)
df7

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    NaN
1          2     Tolstoy         War and Peace         1  700.0
2          3  Dostoevsky             The Idiot         1  450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0
4          4     unknown      Fathers and Sons         0    NaN
5          3  Dostoevsky           The Gambler         2  400.0
6          5     Chekhov         Three Sisters         3  350.0

## Применение функций и методов

Между столбцами можно производить арифметические действия

In [34]:
df7['total'] = df7['quantity'] * df7['price']
df7

   author_id author_name            book_title  quantity  price   total
0          1     Pushkin               unknown         0    NaN     NaN
1          2     Tolstoy         War and Peace         1  700.0   700.0
2          3  Dostoevsky             The Idiot         1  450.0   450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0   500.0
4          4     unknown      Fathers and Sons         0    NaN     NaN
5          3  Dostoevsky           The Gambler         2  400.0   800.0
6          5     Chekhov         Three Sisters         3  350.0  1050.0

In [35]:
df7['price'].max()

700.0

In [36]:
df7['price'].min()

350.0

In [37]:
df7['price'].mean()

480.0

In [38]:
df7['price'].median()

450.0

In [39]:
df7['price'].std()

135.09256086106296

In [40]:
df7['price'].var()

18250.0

Вывод 3 самых больших цены на книги

In [42]:
df7.nlargest(3, 'price')

   author_id author_name            book_title  quantity  price  total
1          2     Tolstoy         War and Peace         1  700.0  700.0
3          3  Dostoevsky  Crime and Punishment         1  500.0  500.0
2          3  Dostoevsky             The Idiot         1  450.0  450.0

Вывод уникальных значений столбца

In [44]:
df7['author_name'].unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Chekhov'],
      dtype=object)

Выводит количество уникальных значений

In [45]:
df7['author_name'].nunique()

5

Выводит информацию сколько раз каждое значение встречается в столбце

In [48]:
df7['author_name'].value_counts()

Dostoevsky    3
Tolstoy       1
Pushkin       1
unknown       1
Chekhov       1
Name: author_name, dtype: int64

Применение к значениям DataFrame методов и функций, которые не входят в библиотеку Pandas, вписав в метод apply название функции или анонимную функцию

In [50]:
df7['book_title'].apply(lambda x: x.upper())

0                 UNKNOWN
1           WAR AND PEACE
2               THE IDIOT
3    CRIME AND PUNISHMENT
4        FATHERS AND SONS
5             THE GAMBLER
6           THREE SISTERS
Name: book_title, dtype: object

## Группировка данных

Группировка максимальной цены по автору (Узнаем максимальную стоимость книги у автора)

Способ 1:

In [51]:
df7.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

Способ 2:

In [52]:
price_agg = df7.groupby('author_name').agg({'price': 'max'})
price_agg

             price
author_name
Chekhov      350.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

После получения значения price_agg, мы можем переустановить индекс и переименовать столбец price

In [54]:
price_agg = price_agg.reset_index()
price_agg = price_agg.rename(columns = {'price': 'max_price'})
price_agg

  author_name  max_price
0     Chekhov      350.0
1  Dostoevsky      500.0
2     Pushkin        NaN
3     Tolstoy      700.0
4     unknown        NaN